Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: facing the Bhagavat, placed his palms together and

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: inquired of the Bhagavat,

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཤིན་ཏུ་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཐོབ་བོ།
en: “Bhagavat, I have perceived a great, wonderful marvel.

source: བཅོམ་ལྡན་འདས་འོད་ཟེར་ཆེན་པོ་འདི་དག་ག་ལས་མཆིས།
en: Bhagavat, where did these great light rays come from?

source: རྫུ་འཕྲུལ་གྱི་ཡུལ་གྱི་མཐུ་འདི་སུའི་ལགས།
en: Who has this power?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འདི་ནི་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ཞུགས་ནས་
en: “Noble son, Bodhisattva Mahāsattva Avalokiteśvara entered the great Avīci hell.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། ཡོངས་སུ་སྨིན་པར་བྱས་ནས་ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དུ་འདུག་གོ།
en: When he had completely liberated the beings there, he went to the city of the pretas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Sarva­nīvaraṇa­viṣkambhin asked the Bhagavat,

source: བཅོམ་ལྡན་འདས་མནར་མ་མཆིས་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ན་མནར་མི་གདའ་ན།
en: “Bhagavat, as the great Avīci hell is without respite,

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འཇུག་པར་བགྱིད།
en: how did Bodhisattva Mahāsattva Avalokiteśvara enter it?

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ལྕགས་ཀྱི་རྩིག་པས་བསྐོར་ལ། ལྕགས་ཀྱི་དོག་ས་ལ་ཤིན་ཏུ་འབར་བ།
en: In the great Avīci hell a wall encloses a ground made of burning iron,

source: མེ་ལྕེ་གཅིག་ཏུ་འདུས་པ། རྣམ་པར་གཡོ་བ་དེ་ན་འབོད་གྲོགས་པ་དག་གནས་པའི་སྣོད་ཟ་མ་ཏོག་འདྲ་བ་མཆིས་ཏེ། སྣོད་དེར་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་སྩལ་ཏོ། །
en: which has become one raging flame in the shape of a reed basket. Within this Avīci hell there is a pot from which comes the sound of wailing. Many hundreds of thousands of tens of millions of hundreds of millions of beings have been thrown into that pot.

source: ནམ་ཆུ་མང་པོ་མཆིས་པའི་སྣོད་ན་སྲན་ཆུང་ཀ་རུའམ། ན་གུ་གྱེན་དུ་མཆི་ན་ཡང་བྲེལ་བ་དང་སྨིན་པར་འགྱུར། ཐུར་དུ་མཆི་ན་ཡང་བྲེལ་བ་དང་སྨིན་པར་འགྱུར་བ་
en: Just as green or black mung beans are massed together in a water-filled vessel, rising and sinking as they are cooked,

source: དེ་བཞིན་དུ་སེམས་ཅན་དེ་དག་ཀྱང་མནར་མ་མཆིས་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེར་ལུས་ཀྱི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་ན།
en: that is how the beings in the great Avīci hell undergo physical suffering.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མནར་མ་མཆིས་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་འཇུག་པར་བགྱིད།
en: Bhagavat, how did Bodhisattva Mahāsattva Avalokiteśvara enter the great Avīci hell?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Bhagavat answered him,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཡང་། མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་འཇུག་མོད་ཀྱི།
en: “Noble son, Bodhisattva Mahāsattva Avalokiteśvara entered the great Avīci hell

source: ཇི་ལྟར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷའི་ནོར་བུ་རིན་པོ་ཆེ་ལས་བྱས་པའི་སྐྱེད་མོས་ཚལ་དུ་འཇུག་པ་དེ་བཞིན་དུ།
en: just as a cakravartin king enters a grove made of divine jewels.

source: དེའི་ལུས་ལ་གཞན་དུ་འགྱུར་བ་མེད་དོ། །ནམ་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དང་ཉེ་བར་འགྲོ་བ་དེའི་ཚེ་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་བསིལ་བར་འགྱུར་ཏེ།
en: it had no effect upon his body. As he approached the Avīci hell, it cooled.

source: མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ཅི་མི་དགེ་བའི་ལྟས་ཤིག་བྱུང་ན།
en: ‘Why has an inauspicious sign appeared in this Avīci hell?’

source: ནམ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འོངས་པ་དེའི་ཚེ། མེ་ཏོག་པད་མ་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་བྱུང་ཞིང་།
en: When the bodhisattva Avalokiteśvara entered the Avīci hell, lotus flowers the size of cartwheels appeared,

source: སྣོད་དེ་ཡང་གསལ་མེ་དེའི་འོབས་དེ་ཉིད་དུ་ཡང་རྫིང་བུ་བྱུང་བར་གྱུར་ཅེས་སྐྱོ་བར་གྱུར་ཏོ།
en: the pot burst open, and the inferno of fire transformed into a pool.

source: དེ་ནས་གཤིན་རྗེའི་སྐྱེས་བུ་དེ་དག་རལ་གྲི་དང་། གཏུན་དང་མཚོན་ཆ་བྷིཎྜི་པཱ་ལ་དང་། ཏོ་མ་ར་དང་། འགའ་དཱ་དང་། འཁོར་ལོ་དང་། རྩེ་གསུམ་པ་ལ་སོགས་པ་ཐོགས་ནས་གཤིན་རྗེའི་རྒྱལ་པོ་ག་ལ་བ་དེར་སོང་སྟེ། །
en: “Then Yama’s guardians gathered their swords, clubs, short spears, long spears, maces, discuses, tridents, and so on, and, taking all their Avīci utensils, went to the Dharmarāja Yamarāja.

source: ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: When they arrived, they told him,

source: ལྷ་བདག་ཅག་གི་སུག་ལས་ཀྱི་དོག་ས་དེ་ཡོངས་སུ་བས་པར་མཁྱེན་པར་མཛོད་ཅིག
en: ‘Divine One, know first that our place of work is completely destroyed.’

source: ཅིའི་ཕྱིར་ཁྱེད་ཀྱི་ལས་ཀྱིས་ཡོངས་སུ་ཟད་དམ།
en: ‘Why is your place of work completely destroyed?’

source: ལྷ་ཅི་ལགས་མི་མཁྱེན་ཏམ། མནར་མ་མཆིས་པའི་སེམས་ཅན་དམྱལ་བ་དེར་ཐོག་མ་ཁོ་ནར་མི་དགེ་བའི་ལྟས་བྱུང་སྟེ།
en: ‘Divine One, know first that an inauspicious omen appeared in this Avīci hell,

source: སྐྱེས་བུ་ཇི་ལྟར་འདོད་པའི་གཟུགས་ཅན་རལ་པའི་ཅོད་པན་ཅན་ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཕྱིན་པ་དང་
en: There entered a handsome being, with his hair in a topknot, his body beautified by divine adornments,

source: གང་གི་ཚེ་དེ་ཕྱིན་པ་དེའི་ཚེ། མེ་ཏོག་པད་མ་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་ཡང་བྱུང་། །
en: The moment he arrived, lotus flowers the size of cartwheels appeared,

source: སྣོད་དེ་ཡང་གས།
en: the pot burst open,

source: ཞུགས་ཀྱི་འོབས་དེར་ཡང་རྫིང་བུ་བྱུང་བར་གྱུར་ཏོ།
en: and the inferno of fire was transformed into a pool.’

source: དེ་ནས་གཤིན་རྗེའི་རྒྱལ་པོ་སེམས་པར་གྱུར་ཏེ།
en: “Yamarāja wondered,

source: མཐུ་འདི་ལྷ་གང་གི་ཡིན།
en: ‘What deity has manifested this power?

source: ཡང་ན་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། མཐུ་བོ་ཆེ་ལས་དམ་པ་ཐོབ་པ་ཞིག་ས་འདིར་འོངས་སམ།
en: Is this a special result that has occurred through the blessing of the deity Maheśvara, Nārāyaṇa, or some other deity? Have they descended to this level?

source: ཡང་ན་སྲིན་པོ་མཐུ་བོ་ཆེ་ལྷའི་བལ་གླང་གི་སྟོབས་དང་འགྲན་པ་ཉིད་སྐྱེས་སམ་
en: Or has a powerful rākṣasa been born who rivals great Rāvaṇa?’

source: ལྷའི་མིག་གིས་རྣམ་པར་བལྟས་ན། ལྷའི་སྡེའི་ནང་ན་དམ་པ་དེ་ལྟ་བུ་མ་མཐོང་ངོ་། །
en: “He looked with his divine sight into the heavens, wondering whose blessing this could be.

source: དེ་ནས་སླར་ཡང་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་བལྟས་སོ།
en: Then he looked back into the Avīci hell

source: དེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བཞུགས་པ་ཉིད་མཐོང་ངོ་། །
en: and saw Bodhisattva Mahāsattva Avalokiteśvara there.

source: དེ་ནས་གཤིན་རྗེའི་རྒྱལ་པོ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་།
en: “Yamarāja went to Bodhisattva Mahāsattva Avalokiteśvara,

source: ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: bowed down his head to his feet,

source: བསྟོད་པའི་ཁྱད་པར་བྱེད་པར་བརྩོན་པ།
en: and made this special praise:

source: པད་མ་ལ་དགྱེས་པ།
en: lover of lotuses,

source: དམ་པ་སྩོལ་བ། །
en: giver of the supreme boon,

source: དབང་དུ་མཛད་པ།
en: who has power;

source: སའི་སྤྱན་དམ་པ་མཛད་པ། དབུགས་འབྱིན་པར་མཛད་པ།
en: who illuminates the world; who brings relief;

source: ཕྱག་བརྒྱ་སྟོང་པ།
en: who has a hundred thousand arms;

source: སྤྱན་བྱེ་བ་བརྒྱ་སྟོང་པ།
en: who has a hundred thousand times ten million eyes;

source: དབུ་བཅུ་གཅིག་པ།
en: who has eleven heads;

source: རྒོད་མའི་བཞིན་ལྟ་བུའི་མཐར་ཕྱིན་པ།
en: who reaches Vaḍavāmukha;

source: ཆོས་ལ་དགྱེས་པ།
en: who delights in the Dharma;

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཐར་བར་མཛད་པ།
en: who completely frees all beings;

source: རུ་སྦལ་དང་། ཆུ་སྲིན་དང་། ཉ་རྣམས་དབུགས་འབྱིན་པར་མཛད་པ།
en: who brings relief to turtles, crocodiles, and fish;

source: ཡེ་ཤེས་ཀྱི་ཕུང་པོ་དམ་པ་མཛད་པ།
en: who creates the greatest mass of wisdom;

source: དགའ་བ་སྩོལ་བ། །
en: who brings joy;

source: རིན་པོ་ཆེའི་དཔལ་དམ་པ།
en: who is a splendor of jewels;

source: མནར་མེད་པ་ཀུན་སྐེམས་པར་མཛད་པ།
en: who extinguishes Avīci;

source: ཡེ་ཤེས་ཀྱི་དཔལ་གྱིས་བརྒྱན་པ།
en: who is adorned by the splendor of wisdom;

source: ཡེ་ཤེས་ལ་དགྱེས་པ།
en: who delights in wisdom;

source: ལྷ་ཐམས་ཅད་ཀྱིས་མཆོད་པ། ཕྱག་འཚལ་བ། བཀུར་སྟི་བགྱིས་པ།
en: who is the one to whom all devas make offerings, pay homage, and show reverence;

source: མི་འཇིགས་པ་སྩོལ་བ།
en: who brings freedom from fear;

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྟོན་པར་མཛད་པ།
en: who teaches the six perfections;

source: ཉི་མ་ལྟ་བུའི་སྤྱན་མཆོག་མཛད་པ།
en: who illuminates like the sun;

source: ཆོས་ཀྱི་སྒྲོན་མ་མཛད་པ།
en: who creates the lamp of Dharma;

source: ཇི་ལྟར་དགྱེས་པའི་གཟུགས་ཀྱི་གཟུགས་མཆོག །
en: whose perfectly supreme form is whatever form is pleasing;

source: དྲི་ཟའི་གཟུགས་དང་ལྡན་པ།
en: who has the form of a gandharva;

source: གསེར་གྱི་རིའི་གཟུགས་དང་མཚུངས་པ།
en: who has a form like a mountain of gold;

source: རྒྱ་མཚོ་མཆིང་རྣམ་གྱི་གློང་བཞིན་དུ་ཟབ་པ།
en: who is deep like the vast ocean;

source: དོན་དམ་པའི་རྣལ་འབྱོར་རྗེས་སུ་ཐོབ་པ།
en: who has attained the ultimate yoga;

source: བདག་གི་ཞལ་སྟོན་པར་མཛད་པ། །
en: who shows his own face;

source: ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་དུ་མ་དང་ལྡན་པ།
en: who has many hundreds of thousands of samādhis;

source: མངོན་པར་དགྱེས་པར་མཛད་པ། །
en: who brings true pleasure;

source: སྐུ་བརྒྱན་པ་སྐྱེས་བུའི་ཁྱུ་མཆོག །
en: who has a beautified body; who manifests as the supreme rishi;

source: ཁུ་སྒོ་དང་། ཁོང་སྒྲིལ་དང་། འཁྲུལ་འཁོར་གྱི་ལམ་ལས་ཡོངས་སུ་ཐར་བར་མཛད་པ།
en: who brings freedom from the terrors of bondage in stocks and manacles;

source: སྲིད་པ་ཐམས་ཅད་དང་མ་འབྲེལ་བ།
en: who is free from all existences;

source: འཁོར་མང་པོ་འབྱུང་བར་འགྱུར་བ་ཉེ་བར་བསགས་པ།
en: who has many retinues; who creates abundance;

source: ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་མཛད་པ།
en: who is a precious wish-fulfilling jewel;

source: མྱ་ངན་ལས་འདས་པའི་ལམ་སྟོན་པར་མཛད་པ། །
en: who teaches the path to nirvāṇa;

source: ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་སྐེམས་པར་མཛད་པ།
en: who brings the city of the pretas to an end;

source: སྐྱེ་བོ་ལ་གདུགས་སུ་གྱུར་པར་མཛད་པ། །
en: who is a parasol for beings;

source: ནད་ལས་ཡོངས་སུ་ཐར་བར་མཛད་པ།
en: who liberates beings from illness;

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོའི་མཆོད་ཕྱིར་ཐོགས་པ།
en: who has a sacred thread made of the nāga kings Nanda and Upananda;

source: དོན་ཡོད་པར་འགྱུར་བའི་ཞགས་པ་སྟོན་པར་མཛད་པ། སྔགས་བརྒྱ་ཕྲག་དུ་མ་དང་ལྡན་པ། ལག་ན་རྡོ་རྗེ་སྐྲག་པར་མཛད་པ།
en: who reveals the beneficial lasso; who has hundreds of mantras; who terrifies Vajrapāṇi;

source: འཇིག་རྟེན་གསུམ་པོ་སྐྲག་པར་མཛད་པ།
en: who terrifies the three worlds;

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་དང་། ཕྲ་མེན་ཕ་དང་། ཕྲ་མེན་མ་དང་། རོ་ལངས་དང་། མཁའ་འགྲོ་མ་དང་། གྲུལ་བུམ་དང་། རྗེད་བྱེད་རྣམས་སྐྲག་པར་མཛད་པ།
en: who frightens yakṣas, rākṣasas, bhūtas, pretas, and piśācas, vetālas, ḍākinīs, kūṣmāṇḍas, and apasmāras;

source: སྤྱན་ཨུད་པ་ལ་སྔོན་པོ་ལྟ་བུ།
en: who has eyes like blue lotuses;

source: རིག་པའི་བདག་པོ་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བར་མཛད་པ། །
en: who is the lord of knowledge; who brings freedom from all afflictions;

source: བྱང་ཆུབ་ཀྱི་ལམ་སྣ་ཚོགས་བསགས་པ། ཐར་པའི་དམ་པ་ལ་ཞུགས་པ། །
en: who accumulates various paths to enlightenment; who has entered sacred liberation;

source: སྐུ་ལ་བྱང་ཆུབ་ཀྱི་ལམ་བསགས་པ།
en: who has paths to enlightenment accumulated within his body;

source: ཡི་དགས་ཡོངས་སུ་ཐར་བར་མཛད་པ། །
en: who completely liberates pretas;

source: ཏིང་ངེ་འཛིན་རྡུལ་ཕྲ་རབ་ལྟ་བུ་བརྒྱ་སྟོང་དང་ལྡན་པ་
en: and who has hundreds of thousands of samādhis as numerous as atoms.’

source: དེ་ལྟར་གཤིན་རྗེའི་རྒྱལ་པོས་ཁྱད་པར་དམ་པའི་བསྟོད་པས་བསྟོད་ནས།
en: “In that way, Yamarāja praised Avalokiteśvara with a particularly sacred praise.

source: སླར་ཡང་གཤིན་རྗེའི་རྒྱལ་པོས་ལན་གསུམ་བསྐོར་ཏེ་དེ་ཉིད་ནས་སོང་ངོ་།
en: Then Yamarāja circumambulated him three times and departed.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Bodhisattva Sarva­nīvaraṇa­viṣkambhin asked the Bhagavat,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཆིའམ།
en: “Bhagavat, did Bodhisattva Mahāsattva Avalokiteśvara leave?”

source: རིགས་ཀྱི་བུ་དེ་ནི་མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ནས་བྱུང་སྟེ། ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དུ་སོང་ནས་
en: “Noble son, he left the Avīci hell and went to the city of the pretas.

source: ཡི་དགས་བརྒྱ་སྟོང་དུ་མ་མདུན་ནས་རྒྱུག་གོ། །
en: Many hundreds of thousands of pretas came running toward him.

source: ཀེང་རུས་བསྒྲེང་བ་དང་།
en: they were like standing skeletons;

source: བདག་གི་སྐྲ་དང་སྤུས་གཡོགས་པ་དང་།
en: they were covered with hair;

source: ལྟོ་རི་དང་འདྲ་བ་དང་། །
en: they had stomachs the size of mountains and

source: ཁ་ཁབ་ཀྱི་མིག་ལྟ་བུའི་
en: mouths the size of a needle’s eye.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནམ་ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དུ་སོང་བ་དེའི་ཚེ་ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དེ་བསིལ་བར་འགྱུར།
en: “As Bodhisattva Mahāsattva Avalokiteśvara arrived at the city of the pretas, it cooled

source: རྡོ་རྗེའི་སེར་བ་དེ་ཡང་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: and the vajra hail ceased.

source: སྒོ་བ་དེ་ཡང་བྱིན་པ་ཐག་ཐུག་ཅན་ལ་མིག་དམར་ཞིང་ལག་ན་ཁར་བ་ཐོགས་པ་ལས་ཀྱིས་འདི་འདྲ་བ་ནི་བདག་གི་བྱ་བ་མ་ཡིན་ནོ་ཞེས་བྱམས་པའི་སེམས་བསྐྱེད་དོ། །
en: The staff-wielding guard at the gates, who had thick calves and red eyes, became kind and said, ‘I should not be performing this duty.’

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ། ཤིན་ཏུ་ཐུགས་བརྩེ་བའི་ཟིལ་གྱིས་ནོན་ནས།
en: “Bodhisattva Mahāsattva Avalokiteśvara’s mind was filled with compassion on seeing these beings,

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཕྱག་གི་སོར་མོ་བཅུ་ལས་ཆུ་བོ་ཆེན་པོ་བཅུ་བྱུང་། །
en: and he emitted ten rivers from his ten fingers;

source: ཞབས་ཀྱི་སོར་མོ་བཅུ་ལས་ཆུ་བོ་ཆེན་པོ་བཅུ་བྱུང་སྟེ།
en: he emitted ten rivers from his ten toes;

source: བ་སྤུའི་ཁུང་བུ་ནས་ཆུ་བོ་བྱུང་ངོ་།
en: and he emitted great rivers from all his pores.

source: གང་གི་ཚེ་ན་དེ་དག་གིས་ཆུ་མྱོང་བ་དེའི་ཚེ་དེ་དག་མགྲིན་པ་ཡངས་པར་གྱུར། ལུས་ཀྱང་ཡོངས་སུ་རྫོགས་པར་གྱུར།
en: When the pretas tasted the water, their throats widened, their bodies became whole,

source: ལྷའི་ཟས་རོའི་ནང་ན་རོ་མཆོག་ཏུ་བྱུང་བ་དང་ལྡན་པས་ཚིམ་པར་གྱུར་ནས་
en: and they were completely satisfied by the supreme flavor of divine food.

source: དེའི་ཚེ་འཁོར་བའི་བསམ་པ་ལ་སེམས་ཏེ།
en: “Then they contemplated human existence. They thought about saṃsāric existence in this way:

source: ཀྱེ་མའོ་འཛམ་བུའི་གླིང་གི་མི་འདི་དག་ནི་གྲིབ་མ་བསིལ་བ་ལ་ཡོངས་སུ་བསྟེན་ཏོ།
en: ‘Oh! The humans in Jambudvīpa are happy. They can perfectly enjoy cool shade.

source: ཡང་འཛམ་བུའི་གླིང་གི་མི་འདི་དག་ནི་རྟག་ཏུ་ཕ་མ་ལ་ཡོངས་སུ་འཛིན་ཅིང་བསྙེན་བཀུར་བྱེད་དེ་བདེ་བ་དང་ལྡན་པའོ།
en: Happy are those humans in Jambudvīpa who are always supporting their parents and honoring them.

source: གང་རྟག་ཏུ་དགེ་བའི་བཤེས་གཉེན་དང་སྟེན་ཅིང་སྐྱོང་བའི་སྐྱེས་བུ་དེ་དག་ནི་བདེ་བ་དང་ལྡན་པའོ། །
en: Happy are those good humans who always rely on a kalyāṇamitra.

source: གང་རྟག་ཏུ་ཐེག་པ་ཆེན་པོ་རྟག་ཏུ་ཁོང་དུ་ཆུད་པར་བྱེད་པའི་སྐྱེས་བུ་དམ་པ་དེ་དག་ནི་བསམ་པ་དང་ལྡན་པའོ།
en: Those who continuously learn the Mahāyāna are good contemplative beings.

source: གང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གནས་པར་བྱེད་པ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ། །
en: Those who follow the eightfold path are good beings.

source: གང་ཆོས་ཀྱི་གཎ་ཌཱི་རྡུང་བ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ། །
en: Those who beat the dharmagaṇḍī are good beings.

source: གང་གཙུག་ལག་ཁང་གས་པ་དང་གོགས་པ་རྣམས་སླར་འཆོས་པ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ། །
en: Those who repair dilapidated and ruined monasteries are good beings.

source: གང་སྔོན་གྱི་མཆོད་རྟེན་གྱི་གཟུགས་གས་པ་དང་། གོགས་པ་རྣམས་སླར་འཆོས་པ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ།
en: Those who repair dilapidated, ruined, ancient stūpas are good beings.

source: གང་ཆོས་སྨྲ་བ་དང་རྟེན་པ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ།
en: Those who are dedicated to the sacred representations and the dharmabhāṇakas are good beings.

source: གང་དེ་བཞིན་གཤེགས་པ་འཆག་པ་མཐོང་བ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ། །
en: Those who have seen the activities of a tathāgata are good beings;

source: གང་རང་སངས་རྒྱས་འཆག་པ་མཐོང་བ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ།
en: those who have seen the activities of a pratyekabuddha are good beings;

source: གང་བྱང་ཆུབ་སེམས་དཔའ་འཆག་པ་མཐོང་བ་དེ་དག་ནི་སྐྱེས་བུ་དམ་པའོ་ཞེས་དེ་ལྟར་ལུས་ཀྱི་རྗེས་སུ་སེམས་པ་དང་། །
en: those who have seen the activities of a bodhisattva are good beings.’

source: དེའི་ཚེ་ཐེག་པ་ཆེན་པོའི་མདོ་ཟ་མ་ཏོག་བཀོད་པ་དཀོན་མཆོག་གི་རྒྱལ་པོའི་སྒྲ་བྱུང་ངོ་།
en: “At that time there appeared the sound of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: དེའི་ཚེ་དེ་དག་གི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་བྱུང་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་
en: wisdom, like a thunderbolt, destroyed the view of the aggregates as a self, which is like a mountain with twenty peaks;

source: དེ་དག་ཐམས་ཅད་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་འདོད་པའི་བཞིན་ཞེས་བྱ་བར་སྐྱེས་ནས་
en: and the pretas were all reborn in the realm of Sukhāvatī as bodhisattvas named Ākāṅkṣitamukha.

source: གང་གི་ཚེ་དེས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེའི་ཚེ་སླར་ཡང་སོང་ངོ་།
en: “Avalokiteśvara, having completely liberated those beings, departed from the city of the pretas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Bodhisattva Sarva­nīvaraṇa­viṣkambhin asked the Bhagavat,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཆིའམ། །
en: “Bhagavat, did Bodhisattva Mahāsattva Avalokiteśvara leave?”

source: རིགས་ཀྱི་བུ་ཉི་མ་རེ་རེ་ཞིང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། །
en: “Noble son, each day he completely ripens a million trillion beings.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་སྤོབས་པ་དེ་འདྲ་བ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མེད་དོ། །
en: Noble son, not even the tathāgatas have Bodhisattva Mahāsattva Avalokiteśvara’s prowess.”

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ།
en: Sarva­nīvaraṇa­viṣkambhin asked him,

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ།
en: “Bhagavat, how is that so?”

source: འཇིག་རྟེན་དུ་བྱུང་བར་གྱུར་ཏོ།
en: here appeared in this world

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལྷག་མཐོང་ཞེས་བྱ་བ་རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་
en: the Tathāgata, the arhat, the samyaksaṃbuddha, perfect in wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tamed beings, the teacher of gods and humans, the buddha, the Bhagavat Vipaśyin.

source: དེའི་ཚེ་དེའི་དུས་ན་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ང་ནི་སྤོས་ཀྱི་བཞིན་ཞེས་བྱ་བའི་ཚོང་པའི་བུར་གྱུར་ཏེ།
en: “At that time, Sarva­nīvaraṇa­viṣkambhin, I was a merchant named Sugandhamukha,

source: དེའི་ཚེ་ངས་དེ་བཞིན་གཤེགས་པ་ལྷག་མཐོང་ལས་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་བརྗོད་པ་ཐོས་སོ།
en: and I heard Tathāgata Vipaśyin describe the qualities of Avalokiteśvara.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་བརྗོད་པ་ཇི་སྐད་དུ་གསན། །
en: “What were the qualities of Bodhisattva Mahāsattva Avalokiteśvara that you heard the tathāgata describe?”

source: མིག་ལས་ནི་ཉི་མ་དང་ཟླ་བ་བྱུང་།
en: “Āditya and Candra came from his eyes,

source: དཔྲལ་བ་ལས་ནི་དབང་ཕྱུག་ཆེན་པོ།
en: Maheśvara came from his forehead,

source: ཕྲག་པ་ལས་ནི་ཚངས་པ།
en: Brahmā came from his shoulders,

source: སྙིང་ལས་ནི་མཐུ་བོ་ཆེ།
en: Nārāyaṇa came from his heart,

source: མཆེ་བ་གཉིས་ལས་ནི་ལྷ་མོ་དབྱངས་ཅན།
en: Devi Sarasvatī came from his canines,

source: ཁ་ནས་ནི་རླུང་རྣམས་བྱུང་།
en: Vāyu came from his mouth,

source: རྐང་པ་ལས་ནི་ས།
en: Dharaṇī came from his feet,

source: ལྟོ་བ་ལས་ནི་ཆུའི་ལྷ་བྱུང་སྟེ། །
en: and Varuṇa came from his stomach.

source: གང་གི་ཚེ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ལུས་ལས་ལྷ་དེ་དག་བྱུང་བ་དེའི་ཚེ་
en: “When those deities had come from Avalokiteśvara’s body,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་གསུངས་ཏེ། །
en: that bhagavat told the deity Maheśvara,

source: དབང་ཕྱུག་ཆེན་པོ་ཁྱོད་དུས་ངན་པའི་ཚེ་སེམས་ཅན་གྱི་ཁམས་མ་རུངས་པ་དག་བྱུང་བ་ན་ཁྱོད་ཐོག་མར་བྱེད་པ་པོ་དང་། གཏོང་བ་པོའི་ལྷར་གྲགས་པར་འགྱུར་རོ། །
en: ‘Maheśvara, in the kaliyuga, when beings have bad natures, you will be declared to be the primal deity who is the creator, the maker.

source: སེམས་ཅན་དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྤངས་པར་འགྱུར་རོ། །
en: All those beings will be excluded from the path to enlightenment.

source: སོ་སོའི་སྐྱེ་བོའི་ནང་དུ་གཏམ་བྱེད་པར་འགྱུར་ཏེ།
en: They will say to ordinary beings:

source: ནམ་མཁའ་ནི་དེའི་རྟགས་སོ།
en: ‘It is said: the sky is his liṅga,

source: ས་ནི་དེའི་ཁྲིའོ། །
en: The earth is his seat.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནི་གནས་སོ།
en: He is the foundation of all beings.

source: ཞུ་བར་འགྱུར་བས་ན་རྟགས་སོ། །ཞེས་ཟེར་བར་འགྱུར་རོ།
en: The liṅga is so called because they dissolve into it.’

source: ཞེས་རིགས་ཀྱི་བུ་ངས་དེ་བཞིན་གཤེགས་པ་ལྷག་མཐོང་ལས་དེ་སྐད་ཐོས་སོ། །
en: “Noble son, those are the words I heard Tathāgata Vipaśyin say.

source: ཞེས་རིགས་ཀྱི་བུ་ངས་དེ་བཞིན་གཤེགས་པ་ལྷག་མཐོང་ལས་དེ་སྐད་ཐོས་སོ།
en: “Noble son, those are the words I heard Tathāgata Vipaśyin say.

source: དེ་འདས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཙུག་ལྡན་ཞེས་བྱ་བ་རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྔོན་འཇིག་རྟེན་དུ་བྱུང་བར་གྱུར་ཏོ།
en: “In a later time, there appeared in this world the Tathāgata, the arhat, the samyaksaṃbuddha, the one with wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tamed beings, the teacher of gods and humans, the buddha, the Bhagavat Śikhin.

source: དེའི་ཚེ་དེའི་དུས་ན་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་ལ་དཔའ་བ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: “At that time, Sarva­nīvaraṇa­viṣkambhin, I was Bodhisattva Dānaśūra,

source: དེ་ལས་ཀྱང་ངས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་བརྗོད་པ་ཐོས་སོ།
en: and I heard from him the description of the qualities of Bodhisattva Mahāsattva Avalokiteśvara.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Bodhisattva Sarva­nīvaraṇa­viṣkambhin asked the Bhagavat,

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་ཐམས་ཅད་འདུས་པར་གྱུར་ཏེ། གང་གི་ཚེ་ན་
en: When all the devas, nāgas, yakṣas, rākṣasas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, and humans had gathered together,

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདུས་པ་ཆེན་པོ་གཟིགས་ནས་འཁོར་དེའི་ནང་དུ་ཆོས་ཀྱི་གཏམ་བྱ་བར་བརྩམས་པ་
en: the bhagavat Śikhin looked at the great gathering and began to speak of the Dharma within that assembly.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་བྱུང་བ་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ཇ་ཧོང་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་རྣམས་བྱུང་སྟེ།
en: At that time, light rays of various colors emanated from the mouth of Bhagavat Śikhin. They were blue, yellow, red, white, orange, and the color of crystal and of silver.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྣང་བར་བྱས་ནས་སླར་འོངས་ཏེ་བསྐོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོར་སོང་ངོ་།
en: They shone on all worlds in the ten directions, then returned and entered the mouth of the bhagavat.

source: དེ་ནས་འཁོར་དེར། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེ་སྟན་ལས་ལངས་ཏེ།
en: “From within that assembly Bodhisattva Ratnapāṇi arose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: bared one shoulder,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། །
en: and kneeling on his right knee

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and facing Bhagavat Śikhin, placed his palms together and addressed these words to him:

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ལྟས་འདི་ལྟ་བུ་བསྟན་པར་གྱུར།
en: ‘Bhagavat, why did this sign appear?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དེ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ནས་འོང་སྟེ།
en: ‘Noble son, Bodhisattva Mahāsattva Avalokiteśvara is coming from the realm of Sukhāvatī.

source: དེ་འོང་བའི་ཚེ་ལྟས་འདི་འདྲ་བ་སྟོན་ཏོ། །
en: I manifest this kind of sign when he is coming.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འོང་བ་དེའི་ཚེ་ཤིང་དཔག་བསམ་རྣམས་ཀྱང་འཕེལ་བར་འགྱུར།
en: When Bodhisattva Mahāsattva Avalokiteśvara comes, a profusion of wish-granting trees appears,
